NextFOAM-2401/tutorials/multiphase/icoReactingMultiphaseInterFoam/evaporationMultiComponent/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (liquid gas);

liquid
{
    type            pureMovingPhaseModel;
}

gas
{
    type            multiComponentMovingPhaseModel;
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.07;
    }
);

massTransferModel
(
    (liquid to gas)
    {
        type            Lee;
        species         vapour.gas;
        C               100;
        Tactivate       366;
    }
);


// ************************************************************************* //
